Revit 2027 API
BuiltInFailures.FamilyFailures.InvalidFamilyType Property
 Invalid family type "[Type Name]".
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidFamilyType { get; }
Public Shared ReadOnly Property InvalidFamilyType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidFamilyType {
	FailureDefinitionId^ get ();
}
static member InvalidFamilyType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace